# DB
alexcvzz.vscode-sqlite

# Resources
analytic-signal.preview-mp4
jock.svg
tomoki1207.pdf
evilz.vscode-reveal
grapecity.gc-excelviewer
hall.draw
pomdtr.excalidraw-editor
tyriar.luna-paint
arthurlobo.easy-codesnap

# Angular/Vue
Angular.ng-template
dbaeumer.vscode-eslint
vue.volar
bradlc.vscode-tailwindcss

# AsciiDoctor/Doxygen
asciidoctor.asciidoctor-vscode
bbenoist.Doxygen
cschlosser.doxdocgen

# Markdown
bierner.markdown-mermaid
yzhang.markdown-all-in-one

# Python
charliermarsh.ruff
ms-python.vscode-pylance
ms-python.debugpy
njpwerner.autodocstring
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-slideshow
ms-toolsai.vscode-jupyter-cell-tags

# Git / CI
eamodio.gitlens
gitlab.gitlab-workflow
mhutchie.git-graph

# C/CPP
jacqueslucke.gcov-viewer
ms-vscode.cpptools
ms-vscode.cpp-devtools
ms-vscode.cmake-tools
matepek.vscode-catch2-test-adapter
twxs.cmake
ms-vscode.cmake-tools
fredericbonnet.cmake-test-adapter
ms-vscode.makefile-tools

# Rust
jinxdash.prettier-rust
tamasfe.even-better-toml
dustypomerleau.rust-syntax
rust-lang.rust-analyzer
swellaby.vscode-rust-test-adapter
vadimcn.vscode-lldb

# Generic
esbenp.prettier-vscode
jjjermiah.pixi-vscode
ibm.output-colorizer

# Docker
ms-azuretools.vscode-docker

# Java
redhat.java
redhat.vscode-xml
vscjava.vscode-java-debug
vscjava.vscode-maven
vscjava.vscode-java-test
vscjava.vscode-java-dependency
